In [251]:
import pandas as p
d=p.read_csv("income.csv")
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [252]:
d[["2010"]]

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

# sum

### #sum of particular column

In [253]:

sum=0
for i in d["2010"]:
    sum=sum+i
print(sum)

238547

### #to find a particular row

In [254]:

d.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

### sum of particular column

In [255]:

sum=0
for i in d.iloc[1,2:]:
    sum=sum+i
print(sum)

540959

In [256]:
d["2010"].sum()

238547

### sum of the 4rth row and all columns

In [257]:
#4rth row and all columns
d.iloc[4,2:]

2005    51755
2006    55319
2007    55734
2008    57014
2009    56134
2010    54283
2011    53367
2012    57020
2013    57528
Name: 4, dtype: object

In [258]:
#sum
d.iloc[4,2:].sum()

498154

In [259]:
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

###  sum of 2005 to 2008 columns

In [260]:
d.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [261]:
##final sum of 2005-2008

In [262]:
s=d.iloc[:,2:6].sum()
s.sum()

976808

### or

In [263]:
a=d[["2005","2006","2007","2008"]].sum()
a.sum()

976808

### to find the total sum of individual columns

In [264]:
d.iloc[:,2:].sum()

2005    226699
2006    233403
2007    264727
2008    251979
2009    239995
2010    238547
2011    243311
2012    250194
2013    250567
dtype: int64

### or

In [265]:
d.sum()

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

### final sum  of all columns

In [266]:
u=d.iloc[:,2:].sum()
u.sum()

2199422

### to find the total sum of individual rows

In [267]:
d.sum(1)

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

### final sum of all rows

In [268]:
k=d.sum(1)
k.sum()

2199422

# product

In [269]:
#prod(
a=d.iloc[1:2,2:6].prod()
a

2005    55891
2006    56418
2007    62993
2008    63989
dtype: int64

In [270]:
a=d.iloc[1:2,2:6].prod().prod()
a

-5736403676770409890

# mean()-average

### find the average-mean()

In [271]:
d.iloc[:].mean()

2005    45339.8
2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

### find the avg of 2011 column

In [272]:
d.iloc[:,8].mean()

48662.2

### or

In [273]:
d["2011"].mean()

48662.2

### find the avg of 2nd row

In [274]:
d.iloc[2,2:].mean()

48967.88888888889

# median()-middle value

### 2011 medium value

In [275]:
d["2011"].median()

48621.0

# max

In [276]:
d["2011"].max()

57431

# min

In [277]:
d["2011"].min()

41302

In [278]:
#min value in the column 
d[:].min()

GEOID    04000US01
State      Alabama
2005         36658
2006         37057
2007         40795
2008         39586
2009         36538
2010         38587
2011         41302
2012         39018
2013         39919
dtype: object

In [279]:
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [280]:
d.iloc[:,2:].mean()

2005    45339.8
2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [281]:
a=max(d["2011"])
d[d["2011"]==a]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137

In [282]:
import pandas as p
d=p.read_csv("income.csv")
c=d.copy()
c

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [283]:
c=p.read_csv("income.csv",index_col="State")
c

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [284]:
d.iloc[0:,2:].mean() #column wise avg

2005    45339.8
2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [306]:
c.iloc[0:,2:].mean(1) #row wise avg

State
Alabama       41623.500
Alaska        60633.500
Arizona       49433.250
Arkansas      39100.250
California    55799.875
dtype: float64

### 1.Combined Average Income of all states from 2005 to 2013

In [307]:
c.iloc[0:,2:].mean(1).mean()

49318.075

### 2.State with highest average income in the last three years

In [308]:
c.iloc[:,-3:] #values of last three years

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [309]:
c.iloc[:,-3:].mean() #column wisw avg

2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [310]:
c.iloc[:,-3:].mean(1) #row wise avg

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [313]:
c["last three years avg"]=d.iloc[:,-3:].mean(1)
c

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,NaN
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,NaN
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,NaN
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,NaN
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,NaN

In [314]:
c["last three years avg"]==max(c["last three years avg"])

State
Alabama       False
Alaska        False
Arizona       False
Arkansas      False
California    False
Name: last three years avg, dtype: bool

In [292]:
#last thtree year 
d[d["last three years avg"]==max(d["last three years avg"])].index[0]

1

### 3.State with lowest average income from 2007 to 2010(inclusive)

In [315]:
c.iloc[:,4:8]

             2008   2009   2010   2011
State
Alabama     44476  39980  40933  42590
Alaska      63989  61604  57848  57431
Arizona     46914  45739  46896  48621
Arkansas    39586  36538  38587  41302
California  57014  56134  54283  53367

In [317]:
c.iloc[:,4:8].mean(1)

State
Alabama       41994.75
Alaska        60218.00
Arizona       47042.50
Arkansas      39003.25
California    55199.50
dtype: float64

In [318]:
#lowest avg income
c.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

### Print the list of all states in the same line with average income less than California

In [316]:
c.iloc[:,2:].mean(1)

State
Alabama       41623.500
Alaska        60633.500
Arizona       49433.250
Arkansas      39100.250
California    55799.875
dtype: float64

In [319]:
#avg of calfornia
avg=c.iloc[4,2:].mean()
avg

55799.875

### or

In [320]:
avg=c.iloc[-1,2:].mean()
avg

55799.875

In [299]:
#to know thw lesss than calfornia values
d.iloc[:,2:].mean(1)<avg

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [321]:
#list of avg less than calfornia
list(c[c.iloc[:,2:].mean(1)<avg].index)

['Alabama', 'Arizona', 'Arkansas']

### Print the names of states based on descending order of income in the year 2009

In [322]:
a=c.iloc[:,6]
a

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [323]:
b=a.sort_values(ascending=False)
b

State
Alaska        57848
California    54283
Arizona       46896
Alabama       40933
Arkansas      38587
Name: 2010, dtype: int64

In [324]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

### State with the lowest recorded income from 2005 to 2013

In [327]:
c.iloc[:,2:11].idxmin()

2006                    Arkansas
2007                    Arkansas
2008                    Arkansas
2009                    Arkansas
2010                    Arkansas
2011                    Arkansas
2012                    Arkansas
2013                    Arkansas
last three years avg         NaN
dtype: object